Конфигурация/InformationRegisters/НастройкиФормированияСЧАПоВидамЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФормированияСЧАПоВидамЗадолженности</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗадолженностьУчитываетсяВСЧАСДатыПолученияДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитыватьВСЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиЦелейРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЦелейРасчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаОценочнойСтоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыРасчетаОценочнойСтоимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиРасчетПоПартиям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУчетаДляОстатковПартий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьЦеныКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьЦеныОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиФормированияСЧАПоВидамЗадолженности/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 ОбновитьКомментарийНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	
	ОбновитьКомментарийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПериодПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СчетДоверительногоУправленияПриИзмененииНаСервере()
	
	ОбновитьКомментарийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	СчетДоверительногоУправленияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидЗадолженностиПриИзмененииНаСервере()
	
	ОбновитьКомментарийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадолженностиПриИзменении(Элемент)
	
	ВидЗадолженностиПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ОбновитьКомментарийНаСервере()
	
	ПоказатьКомментарий = Ложь;
	
	// Проверяем, что можно выполнить дальнейшую проверку
	Если (ЗначениеЗаполнено(Запись.СчетДоверительногоУправления) И ЗначениеЗаполнено(Запись.Организация) И Запись.Период >= '20191231') 
		И ЗначениеЗаполнено(Запись.ВидЗадолженности) И Запись.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) Тогда
		
		// Для методики РЭМ нужно показывать комментарий
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиЦелейРасчетаСрезПоследних.ВариантРасчетаОценочнойСтоимости = ЗНАЧЕНИЕ(Справочник.ВариантыРасчетаОценочнойСтоимости.РЭМ) КАК ПоказатьКомментарий
		|ИЗ
		|	РегистрСведений.НастройкиЦелейРасчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)) КАК НастройкиЦелейРасчетаСрезПоследних";
		
		Запрос.УстановитьПараметр("Период", 						Запись.Период);
		Запрос.УстановитьПараметр("Организация", 					Запись.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	Запись.СчетДоверительногоУправления);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПоказатьКомментарий = Выборка.ПоказатьКомментарий;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ЭтаФорма.Комментарий) И Не ПоказатьКомментарий Тогда
		ЭтаФорма.Комментарий = "";
	ИначеЕсли ПустаяСтрока(ЭтаФорма.Комментарий) И ПоказатьКомментарий Тогда
		ЭтаФорма.Комментарий = "Для методики РЭМ с 31.12.2019 г. кредиторская задолженность по НДФЛ по умолчанию не включается в СЧА";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
